nicoleconway/movies_app/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  WHERE (title LIKE '%%' OR description LIKE '%%' OR year_released LIKE '%%')
---
  def index
  	#@movies = Movie.all
  	@movies = Movie.search(params[:q])

INSERT INTO "movies" ("created_at", "description", "title", "updated_at", "year_released") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-04-01 02:25:05.639037"], ["description", "movie"], ["title", "new"], ["updated_at", "2015-04-01 02:25:05.639037"], ["year_released", 1998]]
---
  def create
    @movie = Movie.create(movie_params)